package com.xuekai.utils;

public class CatchFishUtil {

    public static void main(String[] args) {
        String read = "本人83年人，06年普通一本院校英语系毕业，今年39了。沈阳定居，老婆全职，孩子9岁。自己足够拼，也赶上了好时候，在某国企，由一名普通业务员做到了分公司总经理，攒了钱安了家，后来疫情来了，公司破产，父亲生病，老爷子又好赌赔了钱，自己转行失败，再回到沈阳。感觉疫情开始到现在时间不长，可经历了好多大起大落。但不光是我，身边的每个人都受到了影响，我自己的经历有些感悟，看到别人的生活也有感悟。人近40，真的快不惑了。\n" +
                "\n" +
                "一，无论何时都要努力，要多赚钱，要攒钱，要在有选择的情况下主动选择。\n" +
                "\n" +
                "其实以前的公司是个一点也不卷的企业，每天正点上班正点下班，大家都很清闲（难怪最后破产）。可以说我是公司少有的主动加班的人，我的加班并不是在办公室不下班，而是考虑到国外的时差，白天跟客户邮件沟通了什么事儿，晚上要再看看邮箱，或者自费给老外打个越洋电话，一是联络感情，二是跟进工作。这样的话一天当成两天用，效率高了订单自然少不了，时间长了老外也能记得你的好。我有几个外商慢慢发展成了伙伴，因为彼此沟通多，相互体谅，在我身上也看到了专业性，有些公司业务以外的订单也都交给我做，这让我学了不少，也赚了不少。\n" +
                "\n" +
                "我的这个习惯也让我没有在大国企缓慢的节奏中迷失自我。15年海外分公司管理层离任，领导推荐我去海外任职履新，我立马就答应了。因为在现有的环境下，我的销量与职务都没有了提升的空间。海外分公司对我来讲是个新的机会，况且补贴也不错，唯独是回不了家。家人也是很支持我的决定，于是15年8月我就飞去埃及，从公司总经理助理开始做，4年多的时间一直做到总经理。这段时间对我个人视野和能力的提升是非常明显的，收入提升也显而易见。主动的选择让我得到了提高，充实了家底，让我后面可以坦然面对公司的变故，这一点我后面会提到。反观身边的很多同事，每天在公司混日子，错过了自我提升的黄金期，也没赚到多少钱。\n" +
                "\n" +
                "驻外时的高收入让我有了一些家底，但是我跟媳妇儿都不是大手大脚花钱的人。我们把钱攒下，给孩子买了小学和初中的学区房，也算在沈阳扎下了根。收入的充裕，也让我跟媳妇儿之间从来没有因为柴米油盐之类的事情吵架，家庭非常和谐，这是我驻外以及做出口副业为家庭带来最直观的收益。\n" +
                "\n" +
                "二，要认清自己收入的天花板，不做跨越消费，不贪财，现金流比盈亏重要\n" +
                "\n" +
                "我老婆以前做教培行业的，教培最火的时候，她在家带孩子。她以前的同事，当时每个月2-3万太正常了。身边两个朋友，A在新东方一个月稳定3W，另一个两口子AA在学而思也有2.5W。这样的日子持续了三四年。A在沈阳贷款买了三套房，一套给父母两套期房投资，还在广西的北海有一套投资。AA也在第一套刚需尚未还清贷款的情况下，贷款200W又入手了一套大平米洋房。结果没几年教培行业集体哑火，加上疫情影响，A的收入断崖式下跌，AA一家直接没了收入。A选择断臂求生，低价卖掉了原本用于改善的住宅，蜗居在一套老破小里，下一步只能选择将老人送回老家，再卖掉一套回血。北海的投资房每月要还贷不说，挂出去根本无人接盘，只能挺着。AA家更是无奈选择断供，还欠了银行一笔违约金。\n" +
                "\n" +
                "其实疫情以前很多人都飘了，认为自己的高收入可以一直维持下去。殊不知大多数人在35岁时如果升不到管理层，不考虑副业的话，已经触到了收入的天花板。因为35岁以后，我们的学习能力，体力甚至精力都逐渐下降，不可避免的会被市场上的年轻劳动力所替代。很多人被国内疯狂的楼市所裹挟，认为投资真的是买了就赚，对于可能的亏损或者现金流困难完全不做准备。在面临疫情这种黑天鹅的时候，没有足够的粮食过冬。曾经的高收入并没有换来高质量的生活，反而造成了高额的负债。当高收入结束的时候，才发现自己并未享受到更高质量的生活，好似南柯一梦，只能黯然神伤。\n" +
                "\n" +
                "三，要拿得起放得下，要认清同事与朋友\n" +
                "\n" +
                "这一条主要是我个人的感受，跟疫情关系不大。我是19年底因个人原因调回国的，紧接着公司领导层发生了很大变化。国贸公司的总经理调走了，新任是原来三个副总中的一个。我跟了十年的老领导（副总）被调到外地的分公司，另一个跟我关系不错的副总被调离原市场，束之高阁。紧接着新任总经理对原本我们团队的某成员死扣帽子，组织全公司的批斗大会，什么贪污受贿举报纪委都出来了。这种事儿是让我非常惊愕的，因为我自从上班以后没有见过任何一个总经理用如此白色恐怖的手腕来管理团队。而且他在公开场合爆出的所谓“涉案金额”我自己查了查确认比这些年总业务额都多出一个零！最可笑的，公司破产的时候，所有人都按照公司政策签署了补偿协议，包括我被扣帽子的同事。相当于领导皮鞭一顿挥，最后打了个空气。\n" +
                "\n" +
                "这个事情也逐渐影响到了我。其实我跟公司一众同龄人关系都是不错的，每次从国外回来我都会组织大家一起吃吃饭喝喝酒，维系一下关系。涉及到我的业务，在合理范围内我都尽量让兄弟部门干得舒服一些。可公司出现变动以后，所有人都与我主动划清了界限。我回国后很长时间没有收到任何一次的饭局邀请。有一次某人主动邀请我赴局，我兴高采烈的去吃饭，结果他同时找了新任总经理的亲信，人家新近提了副总，自然对我这前朝的臣子一顿耀武扬威冷嘲热讽，组局的就在一边静静的看着，我突然意识到我只是人家投靠新主子的“投名状”。\n" +
                "\n" +
                "这种情况在很长时间内让我非常困扰，认为他们对不起我。直到我意识到，是我自己把同事误认为了朋友。当我把这些人重新归类为同事后，我就放下了对他们的不满，认为他们所做的一切都可以理解。一朝天子一朝臣，谋饭吃的自然要了解主子的好恶，只不过是我自己滥情罢了。当然也看到了这些人的短视以及手法的粗劣，那时公司已经到了破产的边缘，总经理已然不能对下面任何人的职位和待遇做出变动，所有人最终的结局都是买断离开。他们纳出的投名状，换回的无非是主子口头上的一句认可，对自己的结局不会有任何影响。这一点我能看到而他们看不到，这就是努力提升自己，与虚度光阴之人的区别。\n" +
                "\n" +
                "四，要承担家庭责任，做好选择\n" +
                "\n" +
                "我19年底回国后，这两年一直在闹疫情。老家哈尔滨的政策尤其BT，我也基本没有回去过。可以说我忘记了父母已经60多了，没有尽到我作为儿子的责任。结果今年3月，先是父亲打电话通知我自己得了肺癌，然后家里的亲戚又通知我父亲这两年嗜赌如命，几次跟我妈动手，还把家里的钱都垫到自己的工程里，包括我放在我母亲这的私房钱。真正遇到事儿的时候，我妈手上现金只有几万。\n" +
                "\n" +
                "这个事情的发生，使我毅然辞掉了北京不喜欢的工作，回到哈尔滨对事情原委进行了解，处理父母之间的关系，核实父亲的工程账目，充实家里的现金情况，还给父亲做了一顿炸酱面。起初我对父母的表现是十分不满意的。作为儿子我没有让父母掏钱买房买车，也没让他们过来看孩子，为的就是他们能够享受一个自由的退休时光，我爸还有时间做些工程补贴家用。但是家里的钱全部贴进去，赶上疫情要不回来，我是万万没有想到的。\n" +
                "\n" +
                "后续我也想通了，是我没有起到一个儿子的责任，对家里的情况进行清楚的了解，才会让事态发展到这样一个地步。以前自己一直想着赚钱，很久都忘记了我还是个儿子，而且是个年近40的儿子，父母对生活的掌控逐渐弱化是不可避免的。与其说做一份自己不喜欢的工作，稍有盈余，而不去承担一个儿子，一位父亲的责任，我觉得是得不偿失的。家庭与高收入之间，每个人都需要做出选择。我选择家庭，因为我认为不亏钱也是赚。而且以前驻外的时候，看过几次朋友家人的生死离别，我不想父亲走的时候，我还在隔离。不想孩子长大了跟我无法交流。后续的工作哪怕居家，哪怕收入低点，还是要离家近，让我能多照顾家里。\n" +
                "\n" +
                "五，活着才有可能，要活着\n" +
                "\n" +
                "这段时间我又在沈阳的家里封闭着呢，不断在网上看到有人面对种种的压力，选择放弃生命。生活压力不大的沈阳尚且如此，上海的情况更严重些。我想说大家真的要看重自己的生命，房子没了可以再买，钱赔了可以再赚，甚至老婆跑了都可以再找，人生中有什么坎过不去呢？这两年只是居家多了些，大家的收入受到影响，可我们一没有被人侵略二不用出国打仗，实际上大多数人都没有受到生命的威胁，仅仅是钱比以前少了，生活受损害了，千万不能自暴自弃，千万不要放弃生命。活着才有可能，要活着才能享受生活，才有翻身的可能。疫情的影响下大家都是受影响的，但疫情终有结束的一天，为了烤串火锅溜肉段，也一定要挺住，要活着，加油";
        int length = read.length();
        int size = 100;
        int from = 0,to = 100;
        while (to<length){
            System.out.println(read.substring(from,to));
            from +=size;
            to +=size;
        }

        //最后一行
        System.out.println(read.substring(from,length));

    }
}
